# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

# TODO: your code here

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
i =  0
while i < len(names):
    print(names[i], end=", ")
    i += 1
